CanModifyDetailLevel Method
 Check if Detail Level can be modified.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public bool CanModifyDetailLevel()
  Visual Basic
Public Function CanModifyDetailLevel As Boolean
  Visual C++
public:
bool CanModifyDetailLevel()
 Return Value
 True if Detail Level can be modified.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →